In [1]:
import pandas as pd
import numpy as np

In [2]:
randMatrix=np.random.randn(4,3)

In [3]:
randMatrix

array([[-1.13410644, -0.95751835, -0.98821867],
       [ 1.66506257,  1.35895275,  1.42628135],
       [ 0.45055647,  1.76922774,  0.08453874],
       [ 0.67107921, -1.81559975,  0.40487646]])

In [4]:
dataFrame = pd.DataFrame(randMatrix)

In [5]:
dataFrame

          0         1         2
0 -1.134106 -0.957518 -0.988219
1  1.665063  1.358953  1.426281
2  0.450556  1.769228  0.084539
3  0.671079 -1.815600  0.404876

In [6]:
dataFrame[0] #column olarak getirir

0   -1.134106
1    1.665063
2    0.450556
3    0.671079
Name: 0, dtype: float64

In [7]:
type(dataFrame[0])

pandas.core.series.Series

In [8]:
newDataFrame=pd.DataFrame(randMatrix,index=["Ecem","Sevval","Cinar","Izmir"],columns=["Age","Hour","Price"])

In [9]:
newDataFrame

             Age      Hour     Price
Ecem   -1.134106 -0.957518 -0.988219
Sevval  1.665063  1.358953  1.426281
Cinar   0.450556  1.769228  0.084539
Izmir   0.671079 -1.815600  0.404876

In [10]:
newDataFrame["Age"]

Ecem     -1.134106
Sevval    1.665063
Cinar     0.450556
Izmir     0.671079
Name: Age, dtype: float64

In [11]:
newDataFrame[["Hour","Age"]]

            Hour       Age
Ecem   -0.957518 -1.134106
Sevval  1.358953  1.665063
Cinar   1.769228  0.450556
Izmir  -1.815600  0.671079

In [12]:
newDataFrame.loc["Ecem"]
#get row, loc->locate

Age     -1.134106
Hour    -0.957518
Price   -0.988219
Name: Ecem, dtype: float64

In [13]:
newDataFrame.loc["Izmir"]

Age      0.671079
Hour    -1.815600
Price    0.404876
Name: Izmir, dtype: float64

In [14]:
newDataFrame.iloc[1]
#get row by index

Age      1.665063
Hour     1.358953
Price    1.426281
Name: Sevval, dtype: float64

In [15]:
newDataFrame["Retired"]=newDataFrame["Age"] + newDataFrame["Age"]

In [16]:
newDataFrame

             Age      Hour     Price   Retired
Ecem   -1.134106 -0.957518 -0.988219 -2.268213
Sevval  1.665063  1.358953  1.426281  3.330125
Cinar   0.450556  1.769228  0.084539  0.901113
Izmir   0.671079 -1.815600  0.404876  1.342158

In [17]:
newDataFrame.drop("Retired",axis=1)
#delete from column

             Age      Hour     Price
Ecem   -1.134106 -0.957518 -0.988219
Sevval  1.665063  1.358953  1.426281
Cinar   0.450556  1.769228  0.084539
Izmir   0.671079 -1.815600  0.404876

In [18]:
newDataFrame.drop("Cinar",axis=0)
#delete from row

             Age      Hour     Price   Retired
Ecem   -1.134106 -0.957518 -0.988219 -2.268213
Sevval  1.665063  1.358953  1.426281  3.330125
Izmir   0.671079 -1.815600  0.404876  1.342158

In [19]:
newDataFrame
#deleted some row and column vars but nothing changed

             Age      Hour     Price   Retired
Ecem   -1.134106 -0.957518 -0.988219 -2.268213
Sevval  1.665063  1.358953  1.426281  3.330125
Cinar   0.450556  1.769228  0.084539  0.901113
Izmir   0.671079 -1.815600  0.404876  1.342158

In [20]:
newDataFrame.drop("Retired",axis=1,inplace=True)
#inplace=True means drop/delete from the exact serie

In [21]:
newDataFrame
#deleted

             Age      Hour     Price
Ecem   -1.134106 -0.957518 -0.988219
Sevval  1.665063  1.358953  1.426281
Cinar   0.450556  1.769228  0.084539
Izmir   0.671079 -1.815600  0.404876

In [22]:
newDataFrame.drop("Izmir",axis=0,inplace=True)

In [23]:
newDataFrame

             Age      Hour     Price
Ecem   -1.134106 -0.957518 -0.988219
Sevval  1.665063  1.358953  1.426281
Cinar   0.450556  1.769228  0.084539

In [24]:
newDataFrame.loc["Ecem"]

Age     -1.134106
Hour    -0.957518
Price   -0.988219
Name: Ecem, dtype: float64

In [25]:
newDataFrame.loc["Ecem"]["Age"]

-1.1341064430131746

In [26]:
newDataFrame.loc["Ecem","Age"]

-1.1341064430131746

In [27]:
newDataFrame<0

          Age   Hour  Price
Ecem     True   True   True
Sevval  False  False  False
Cinar   False  False  False

In [28]:
booleanFrame=newDataFrame<0

In [29]:
booleanFrame

          Age   Hour  Price
Ecem     True   True   True
Sevval  False  False  False
Cinar   False  False  False

In [30]:
newDataFrame[booleanFrame]

             Age      Hour     Price
Ecem   -1.134106 -0.957518 -0.988219
Sevval       NaN       NaN       NaN
Cinar        NaN       NaN       NaN

In [31]:
newDataFrame[newDataFrame<0]

             Age      Hour     Price
Ecem   -1.134106 -0.957518 -0.988219
Sevval       NaN       NaN       NaN
Cinar        NaN       NaN       NaN

In [32]:
newDataFrame[newDataFrame["Hour"]>0]
#hour verisi >0 olanlari getirir

             Age      Hour     Price
Sevval  1.665063  1.358953  1.426281
Cinar   0.450556  1.769228  0.084539

## Multi Indexing

In [33]:
firstIndex=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [34]:
secondIndex=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [35]:
joinedIndex=list(zip(firstIndex,secondIndex))

In [36]:
joinedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [37]:
joinedIndex=pd.MultiIndex.from_tuples(joinedIndex)

In [38]:
joinedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [39]:
type(joinedIndex)

pandas.core.indexes.multi.MultiIndex

In [40]:
cartoonList=[[40,"A"],[30,"B"],[10,"C"],[20,"D"],[9,"E"],[11,"F"]]

In [42]:
cartNumpyArr=np.array(cartoonList)

In [46]:
cartDataFrame=pd.DataFrame(cartNumpyArr,index=joinedIndex,columns={"Age","Job"})

In [47]:
cartDataFrame

                   Job Age
Simpson    Homer    40   A
           Bart     30   B
           Marge    10   C
South Park Cartman  20   D
           Kenny     9   E
           Kyle     11   F

In [48]:
cartDataFrame.loc["Simpson"]

      Job Age
Homer  40   A
Bart   30   B
Marge  10   C

In [50]:
cartDataFrame.loc["South Park"].loc["Kenny"]

Job    9
Age    E
Name: Kenny, dtype: object

In [53]:
cartDataFrame.index.names=["Cartoon","Name"]

In [54]:
cartDataFrame

                   Job Age
Cartoon    Name
Simpson    Homer    40   A
           Bart     30   B
           Marge    10   C
South Park Cartman  20   D
           Kenny     9   E
           Kyle     11   F